%相关性分析
% Spearman斯皮尔曼等级相关系数
% 适应范围：不需要假定服从正态分布
%-----------------------------------------------------------
% 调用格式coeff=corr(X,'type','Spearman')
%        X为n行P列矩阵，表示有P个特征，每个特征有n个样本点
%        coeff为P行P列矩阵，coeff(i,j)表示第i个特征和第j个特征的相关系数
%-------------------------------------------------------------------
% 结果分析
% >0.95 显著相关
% >0.8 高度相关
% 0.5-0.8 中等程度相关
% 0.3-0.5 弱相关
% <0.3 认为不相关
clc;
clear;
close;

filename = '5插值完成.xlsx';
xRange = 'C4:MI328';
xdata = xlsread(filename,xRange);

coeff = corr(xdata,'type','Spearman');


